const generatePopupInfo = () => {
  return {
    image: `santa-claus-conquers-the-martians.jpg`,
    name: `Властелин колец: Две крепости`,
    originalName: `Lord of the Rings: The Fellowship of the Ring`,
    raiting: `10`,
    userRate: `9.5`,
    producer: `Питер Джексон`,
    screenwriters: `Питер Джексон, Фрэн Уолш, Филиппа Бойенс`,
    cast: `Элайджа Вуд, Вигго Мортенсен, Шон Эстин, Иэн Маккеллен`,
    dateAndYear: `2002г`,
    duration: `558m`,
    country: `США`,
    genre: `Фэнтези, приключения`,
    description: `«Властелин колец» является одним из самых крупных проектов в истории кино. Его реализация заняла восемь лет; все три фильма были сняты одновременно в Новой Зеландии, родной стране Джексона. У каждого из фильмов трилогии есть специальная расширенная версия, выпущенная на DVD спустя год после выхода соответствующей театральной версии. Фильмы следуют за основной сюжетной линией книги, но опускают некоторые существенные элементы повествования, включают дополнения и отклонения от исходного материала.`,
    ageRating: `16+`
  };
};

export {
  generatePopupInfo
};
